[
  {
    "id": "stage 0",
    "title": "fundamentals",
    "description": "An introductory stage to get acquainted with computer science and Java basics. You should have initial computer science knowledge. If you don't, please pass this course.",
    "duration": "2 Months",
    "format": "Self-paced, Online, Practical Tasks, Light Talks",
    "program": "Computer science course, Infrastructure & Environment, JDK, JRE, Git Basics, IDE, Junit Concepts, Java Lang Syntax, Java Fundamentals, Algorithms and Data Structures, OOP/OOD Fundamentals",
    "result": "After stage 0 you will be able to develop simple console Java applications."
  },
  {
    "id": "stage 1",
    "title": "core",
    "description": "The stage to get acquainted with core mechanisms and tools Java provide to solve various tasks.",
    "duration": "2 Months",
    "format": "Self-paced, Online, Practical Tasks, Light Talks",
    "program": "Exceptions, Strings, Generics, Collections, Stream API, Java I/O, NIO, Data Formats (JSON, XML, YML), Concurrency",
    "result": "After this stage, you will understand the Java Core and will be able to develop more complex applications."
  },
  {
    "id": "stage 2",
    "title": "web",
    "description": "The stage to get acquainted with Web applications and Web itself.",
    "duration": "1 Month",
    "format": "Self-paced, Online, Practical Tasks, Light Talks",
    "program": "Git & Build Tools, Web, HTTP(s) methods, Java EE Servlets, SQL, Architecture basics, Architectural patterns, Engineering Best-Practices",
    "result": "After this stage, you will be able to develop web applications in Java using Servlets technology, use build and version control tools."
  },
  {
    "id": "stage 3",
    "title": "modern frameworks",
    "description": "The stage to get acquainted with modern frameworks and development approaches and techniques.",
    "duration": "2 Months",
    "format": "Self-paced, Online, Light Talks, Practical Tasks, Roasting Sessions, Consultants",
    "program": "Architecture advanced, ORM - JPA, Hibernate, Spring Core, REST Basics – Spring Web, Swagger",
    "result": "After this stage, you will be able to develop web applications in Java utilizing modern frameworks and libraries."
  },
  {
    "id": "stage 4",
    "title": "enterprise",
    "description": "The stage to dive into frameworks and modern engineering practices.",
    "duration": "2 Months",
    "format": "Online, Light Talks, Practical Tasks, Roasting Battles, Mentoring",
    "program": "CI\\CD, REST Advanced, Spring Boot, Authentication & Authorization, Spring Security, Modern UI, AWS, Spring Data",
    "result": "After this stage, you will be able to deploy your application to the Cloud, configure authentication and develop a UI for your app."
  }
]